In [1]:
#pandas is a python package provide fast, flexible and expressive data structure design to make working with "relational" or "labled " data.
#it has functions for analyzing,cleaning ,exploring and manipulating data.
import pandas as pd
data={"name":["nihal","rohit","amit"],
      "age":[20,50,30],
      "salary":[20000,15000,30000]   
}
df=pd.DataFrame(data)
print (df)

    name  age  salary
0  nihal   20   20000
1  rohit   50   15000
2   amit   30   30000

In [11]:
import pandas as pd
data=pd.read_csv("C:/Users/nihal/OneDrive/Desktop/jupyter notebook/Mall_Customers.csv")
print(data)

     CustomerID   Genre  Age  Annual_Income_(k$)  Spending_Score
0             1    Male   19                  15              39
1             2    Male   21                  15              81
2             3  Female   20                  16               6
3             4  Female   23                  16              77
4             5  Female   31                  17              40
..          ...     ...  ...                 ...             ...
195         196  Female   35                 120              79
196         197  Female   45                 126              28
197         198    Male   32                 126              74
198         199    Male   32                 137              18
199         200    Male   30                 137              83

[200 rows x 5 columns]

In [12]:
print (data.head(10))

   CustomerID   Genre  Age  Annual_Income_(k$)  Spending_Score
0           1    Male   19                  15              39
1           2    Male   21                  15              81
2           3  Female   20                  16               6
3           4  Female   23                  16              77
4           5  Female   31                  17              40
5           6  Female   22                  17              76
6           7  Female   35                  18               6
7           8  Female   23                  18              94
8           9    Male   64                  19               3
9          10  Female   30                  19              72

In [14]:
print (data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   CustomerID          200 non-null    int64
 1   Genre               200 non-null    object
 2   Age                 200 non-null    int64
 3   Annual_Income_(k$)  200 non-null    int64
 4   Spending_Score      200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB
None

In [15]:
data.describe()

       CustomerID         Age  Annual_Income_(k$)  Spending_Score
count  200.000000  200.000000          200.000000      200.000000
mean   100.500000   38.850000           60.560000       50.200000
std     57.879185   13.969007           26.264721       25.823522
min      1.000000   18.000000           15.000000        1.000000
25%     50.750000   28.750000           41.500000       34.750000
50%    100.500000   36.000000           61.500000       50.000000
75%    150.250000   49.000000           78.000000       73.000000
max    200.000000   70.000000          137.000000       99.000000

In [17]:
print(data.isnull().sum())

CustomerID            0
Genre                 0
Age                   0
Annual_Income_(k$)    0
Spending_Score        0
dtype: int64

In [20]:
import pandas as pd
ndata=pd.read_excel("C:/Users/nihal/OneDrive/Desktop/jupyter notebook/Book1.xlsx")
print(ndata)

    EEID      name gender   salary
0  EMP01     ayush      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      F  27000.0
3  EMP01     ayush    NaN  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohan      M      NaN
6  EMP02     rohit      M  25000.0

In [25]:
print(ndata["EEID"].duplicated())                 
print()
print(ndata["EEID"].duplicated().sum())

0    False
1    False
2    False
3     True
4    False
5    False
6     True
Name: EEID, dtype: bool

2

In [26]:
print(ndata.drop_duplicates("EEID"))

    EEID      name gender   salary
0  EMP01     ayush      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      F  27000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohan      M      NaN

In [28]:
#working with missing data
import pandas as pd
ndata=pd.read_excel("C:/Users/nihal/OneDrive/Desktop/jupyter notebook/Book1.xlsx")
print(ndata.isnull())
print()
print(ndata.isnull().sum())

    EEID   name  gender  salary
0  False  False   False    True
1  False  False   False   False
2  False  False   False   False
3  False  False    True   False
4  False   True   False   False
5  False  False   False    True
6  False  False   False   False

EEID      0
name      1
gender    1
salary    2
dtype: int64

In [29]:
 print(ndata.dropna())

    EEID      name gender   salary
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      F  27000.0
6  EMP02     rohit      M  25000.0

In [31]:
mean=ndata["salary"].mean()
print(mean)

24400.0

In [32]:
import numpy as np
ndata["salary"]=ndata["salary"].replace(np.nan,mean)           
print(ndata)

    EEID      name gender   salary
0  EMP01     ayush      F  24400.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      F  27000.0
3  EMP01     ayush    NaN  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohan      M  24400.0
6  EMP02     rohit      M  25000.0

In [33]:
print(ndata.fillna(method="ffill"))

    EEID      name gender   salary
0  EMP01     ayush      F  24400.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      F  27000.0
3  EMP01     ayush      F  20000.0
4  EMP05     ayush      M  25000.0
5  EMP06     rohan      M  24400.0
6  EMP02     rohit      M  25000.0

C:\Users\nihal\AppData\Local\Temp\ipykernel_7988\1936979051.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(ndata.fillna(method="ffill"))

In [34]:
print(ndata.fillna(method="bfill"))

    EEID      name gender   salary
0  EMP01     ayush      F  24400.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      F  27000.0
3  EMP01     ayush      M  20000.0
4  EMP05     rohan      M  25000.0
5  EMP06     rohan      M  24400.0
6  EMP02     rohit      M  25000.0

C:\Users\nihal\AppData\Local\Temp\ipykernel_7988\3004589640.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(ndata.fillna(method="bfill"))

In [42]:
#column tranformation in pandas
import pandas as pd
df=pd.read_csv("C:/Users/nihal/OneDrive/Desktop/jupyter notebook/Mall_Customers.csv")      
df.loc[(df["Annual_Income_(k$)"]>df["Spending_Score"]),"saves_money"]="yes"                      
df.loc[(df["Annual_Income_(k$)"]<df["Spending_Score"]),"saves_money"]="no"
print(df.head(10))

   CustomerID   Genre  Age  Annual_Income_(k$)  Spending_Score saves_money
0           1    Male   19                  15              39          no
1           2    Male   21                  15              81          no
2           3  Female   20                  16               6         yes
3           4  Female   23                  16              77          no
4           5  Female   31                  17              40          no
5           6  Female   22                  17              76          no
6           7  Female   35                  18               6         yes
7           8  Female   23                  18              94          no
8           9    Male   64                  19               3         yes
9          10  Female   30                  19              72          no

In [4]:
import pandas as pd
pdata=pd.read_excel("C:/Users/nihal/OneDrive/Desktop/jupyter notebook/practice.xlsx")
print(pdata)
print()
pdata["Bonus"]=(pdata["salary"]/100)*20
print(pdata)

  first name  last name   salary EEID
0        ross  tribbiani   20000   E1
1      rachel       bing   40000   E2
2      monica      green   25000   E7
3        joey     geller   60000   E8
4     chander     buffay   33000   E4
5      phoebe       bing   45000   E5

  first name  last name   salary EEID    Bonus
0        ross  tribbiani   20000   E1   4000.0
1      rachel       bing   40000   E2   8000.0
2      monica      green   25000   E7   5000.0
3        joey     geller   60000   E8  12000.0
4     chander     buffay   33000   E4   6600.0
5      phoebe       bing   45000   E5   9000.0

In [6]:
#group by in pandas
import pandas as pd
usdata=pd.read_csv("C:/Users/nihal/OneDrive/Desktop/jupyter notebook/USA_cars_datasets.csv")
print(usdata)

      Unnamed: 0  price      brand    model  year   title_status   mileage  \
0              0   6300     toyota  cruiser  2008  clean vehicle  274117.0
1              1   2899       ford       se  2011  clean vehicle  190552.0
2              2   5350      dodge      mpv  2018  clean vehicle   39590.0
3              3  25000       ford     door  2014  clean vehicle   64146.0
4              4  27700  chevrolet     1500  2018  clean vehicle    6654.0
...          ...    ...        ...      ...   ...            ...       ...
2494        2494   7800     nissan    versa  2019  clean vehicle   23609.0
2495        2495   9200     nissan    versa  2018  clean vehicle   34553.0
2496        2496   9200     nissan    versa  2018  clean vehicle   31594.0
2497        2497   9200     nissan    versa  2018  clean vehicle   32557.0
2498        2498   9200     nissan    versa  2018  clean vehicle   31371.0

       color                  vin        lot       state country  \
0      black    jtezu11f88k007763  159348797  new jersey     usa
1     silver    2fmdk3gc4bbb02217  166951262   tennessee     usa
2     silver    3c4pdcgg5jt346413  167655728     georgia     usa
3       blue    1ftfw1et4efc23745  167753855    virginia     usa
4        red    3gcpcrec2jg473991  167763266     florida     usa
...      ...                  ...        ...         ...     ...
2494     red    3n1cn7ap9kl880319  167722715  california     usa
2495  silver    3n1cn7ap5jl884088  167762225     florida     usa
2496  silver    3n1cn7ap9jl884191  167762226     florida     usa
2497   black    3n1cn7ap3jl883263  167762227     florida     usa
2498  silver    3n1cn7ap4jl884311  167762228     florida     usa

          condition
0      10 days left
1       6 days left
2       2 days left
3     22 hours left
4     22 hours left
...             ...
2494    1 days left
2495  21 hours left
2496  21 hours left
2497    2 days left
2498  21 hours left

[2499 rows x 13 columns]

In [12]:
gp=usdata.groupby("brand").agg({"model":"count"})         
print(gp)
print()
gp_sorted = gp.sort_values("model")  
print(gp_sorted)
print()
gp_sorted_desc = gp.sort_values("model", ascending=False)      
print(gp_sorted_desc)
print()
print(gp_sorted_desc.head(10))

                 model
brand
acura                3
audi                 4
bmw                 17
buick               13
cadillac            10
chevrolet          297
chrysler            18
dodge              432
ford              1235
gmc                 42
harley-davidson      1
heartland            5
honda               12
hyundai             15
infiniti            12
jaguar               1
jeep                30
kia                 13
land                 4
lexus                2
lincoln              2
maserati             1
mazda                2
mercedes-benz       10
nissan             312
peterbilt            4
ram                  1
toyota               1

                 model
brand
jaguar               1
harley-davidson      1
toyota               1
maserati             1
ram                  1
lexus                2
mazda                2
lincoln              2
acura                3
land                 4
peterbilt            4
audi                 4
heartland            5
cadillac            10
mercedes-benz       10
honda               12
infiniti            12
kia                 13
buick               13
hyundai             15
bmw                 17
chrysler            18
jeep                30
gmc                 42
chevrolet          297
nissan             312
dodge              432
ford              1235

                 model
brand
ford              1235
dodge              432
nissan             312
chevrolet          297
gmc                 42
jeep                30
chrysler            18
bmw                 17
hyundai             15
kia                 13
buick               13
infiniti            12
honda               12
cadillac            10
mercedes-benz       10
heartland            5
peterbilt            4
land                 4
audi                 4
acura                3
mazda                2
lexus                2
lincoln              2
harley-davidson      1
jaguar               1
maserati             1
ram                  1
toyota               1

           model
brand
ford        1235
dodge        432
nissan       312
chevrolet    297
gmc           42
jeep          30
chrysler      18
bmw           17
hyundai       15
kia           13

In [14]:
 ngp=usdata.groupby("state").agg({"brand":"count"})         
print(ngp)

                brand
state
alabama            17
arizona            33
arkansas           12
california        190
colorado           21
connecticut        25
florida           246
georgia            51
idaho               2
illinois          113
indiana            14
kansas              4
kentucky            9
louisiana          11
maryland            4
massachusetts      27
michigan          169
minnesota         119
mississippi        24
missouri           46
montana             1
nebraska            4
nevada             85
new hampshire       4
new jersey         87
new mexico          4
new york           58
north carolina    146
ohio               31
oklahoma           71
ontario             7
oregon             27
pennsylvania      299
rhode island        2
south carolina     64
tennessee          26
texas             214
utah               10
vermont             2
virginia           90
washington         14
west virginia      21
wisconsin          94
wyoming             1

In [15]:
gpn=usdata.groupby("brand").agg({"mileage":"mean"})         
print(gpn)

                       mileage
brand
acura            120379.666667
audi             118091.000000
bmw               47846.411765
buick             37926.846154
cadillac          40195.900000
chevrolet         65124.461279
chrysler          73004.000000
dodge             44184.863426
ford              52084.304453
gmc               58548.738095
harley-davidson    9502.000000
heartland             1.000000
honda             91599.000000
hyundai           56683.866667
infiniti          25023.166667
jaguar            20849.000000
jeep              38723.266667
kia               56609.461538
land              26613.750000
lexus             22391.000000
lincoln           52123.000000
maserati          37021.000000
mazda             82647.000000
mercedes-benz     54597.000000
nissan            42426.230769
peterbilt        725615.750000
ram               30421.000000
toyota           274117.000000

In [16]:
 gp1=usdata.groupby(["year","brand"]).agg({"mileage":"max","year":"min"})         
print(gp1)

                 mileage  year
year brand
1973 chevrolet   46226.0  1973
1984 ford        41577.0  1984
1993 gmc             0.0  1993
1994 ford       206162.0  1994
1995 chevrolet  274706.0  1995
...                  ...   ...
2020 dodge        5284.0  2020
     ford        23984.0  2020
     kia         11451.0  2020
     lexus        8186.0  2020
     nissan      21009.0  2020

[168 rows x 2 columns]

In [22]:
#merge ,join and concatenate dataframe
import pandas as pd
data1={"emp id":["E01","E02","E03","E04","E05","E06"],
       "names":["ram","shyam","rahul","vishal","ravi","nihal"],
       "age":[34,56,23,44,32,58]}
data2={"emp id":["E01","E02","E03","E04","E05","E06"],
      "salary":[45000,56000,34000,30000,50000,80000]}
dff1=pd.DataFrame(data1)
dff2=pd.DataFrame(data2)
print(dff1)
print()
print(dff2)

  emp id   names  age
0    E01     ram   34
1    E02   shyam   56
2    E03   rahul   23
3    E04  vishal   44
4    E05    ravi   32
5    E06   nihal   58

  emp id  salary
0    E01   45000
1    E02   56000
2    E03   34000
3    E04   30000
4    E05   50000
5    E06   80000

In [25]:
print(pd.merge(dff1,dff2,on="emp id"))

  emp id   names  age  salary
0    E01     ram   34   45000
1    E02   shyam   56   56000
2    E03   rahul   23   34000
3    E04  vishal   44   30000
4    E05    ravi   32   50000
5    E06   nihal   58   80000

In [27]:
import pandas as pd
datas={"emp id":["E01","E02","E03","E04","E05","E06"],
       "names":["ram","shyam","rahul","vishal","ravi","nihal"],
       "age":[34,56,23,44,32,58]}
datas2={"emp id":["E01","E07","E03","E04","E05","E0"],
      "salary":[45000,56000,34000,30000,50000,80000]}
dff3=pd.DataFrame(datas)
dff4=pd.DataFrame(datas2)
print(dff3)
print()
print(dff4)
print()
print(pd.merge(dff3,dff4,on="emp id"))

  emp id   names  age
0    E01     ram   34
1    E02   shyam   56
2    E03   rahul   23
3    E04  vishal   44
4    E05    ravi   32
5    E06   nihal   58

  emp id  salary
0    E01   45000
1    E07   56000
2    E03   34000
3    E04   30000
4    E05   50000
5     E0   80000

  emp id   names  age  salary
0    E01     ram   34   45000
1    E03   rahul   23   34000
2    E04  vishal   44   30000
3    E05    ravi   32   50000

In [28]:
print(pd.merge(left=dff3,right=dff4,on="emp id",how="left"))

  emp id   names  age   salary
0    E01     ram   34  45000.0
1    E02   shyam   56      NaN
2    E03   rahul   23  34000.0
3    E04  vishal   44  30000.0
4    E05    ravi   32  50000.0
5    E06   nihal   58      NaN

In [31]:
datas={"emp id":["E01","E02","E03","E04","E05","E06"],
       "names":["ram","shyam","rahul","vishal","ravi","nihal"],
       "age":[34,56,23,44,32,58]}
datas2={"emp id":["E07","E08","E09","E04","E05","E012"],
      "names":["cc","rohit","raju","surya","arjun","vijay"],
       "age":[34,56,55,63,56,29]}
dff3=pd.DataFrame(datas)
dff4=pd.DataFrame(datas2)

print(pd.concat([dff3,dff4]))

  emp id   names  age
0    E01     ram   34
1    E02   shyam   56
2    E03   rahul   23
3    E04  vishal   44
4    E05    ravi   32
5    E06   nihal   58
0    E07      cc   34
1    E08   rohit   56
2    E09    raju   55
3    E04   surya   63
4    E05   arjun   56
5   E012   vijay   29

In [1]:
#compare dataframes
import pandas as pd
dict={"fruits":["mango","apple","banana","papaya"],
     "price":[100,150,50,35],
     "quantity":[15,10,10,3]}
df=pd.DataFrame(dict)
print(df)
df2=df.copy()
df2.loc[0,"price"]=120
df2.loc[1,"price"]=175
df2.loc[2,"price"]=30
df2.loc[0,"quantity"]=12
df2.loc[1,"quantity"]=15
df2.loc[2,"quantity"]=5
print()
print(df2)    
print(df.compare(df2,align_axis=0))

   fruits  price  quantity
0   mango    100        15
1   apple    150        10
2  banana     50        10
3  papaya     35         3

   fruits  price  quantity
0   mango    120        12
1   apple    175        15
2  banana     30         5
3  papaya     35         3
         price  quantity
0 self   100.0      15.0
  other  120.0      12.0
1 self   150.0      10.0
  other  175.0      15.0
2 self    50.0      10.0
  other   30.0       5.0

In [47]:
#pivoting and melting dataframe
import pandas as pd 
dict={"keys":["k1","k2","k1","k2",],
     "names":["john","ben","david","peter"],
     "houses":["red","blue","green","red"],
     "grades":["3re","8th","9th","8th"]}
df=pd.DataFrame(dict)
print(df)
print()
print(df.pivot(index="keys",columns="names",values=["houses","grades"]))

  keys  names houses grades
0   k1   john    red    3re
1   k2    ben   blue    8th
2   k1  david  green    9th
3   k2  peter    red    8th

      houses                   grades
names    ben  david john peter    ben david john peter
keys
k1       NaN  green  red   NaN    NaN   9th  3re   NaN
k2      blue    NaN  NaN   red    8th   NaN  NaN   8th

In [51]:
#melting
import pandas as pd
dict={"names":["john","ben","david","peter"],
     "houses":["red","blue","green","red"],
     "grades":["3re","8th","9th","8th"]}
df=pd.DataFrame(dict)
print(df)
print()
print(pd.melt(df,id_vars=["names"],value_vars =["houses"]))

   names houses grades
0   john    red    3re
1    ben   blue    8th
2  david  green    9th
3  peter    red    8th

   names variable  value
0   john   houses    red
1    ben   houses   blue
2  david   houses  green
3  peter   houses    red